"CIAdditionCompositing" = "色成分を追加して輝度効果を実現します。このフィルタは通常、ハイライトとレンズフレア効果の追加に使われます。";"CIAffineClamp" = "ソースイメージに対してアフィン変形を実行し、そのイメージの輪郭にあるピクセルをつかんで外側に向かって拡げます。このフィルタは、範囲不定のイメージを生成することを除いて、CIAffineTransform フィルタと同じように実行されます。イメージをぼかしたいが輪郭に沿ってソフトで黒い縁取りの様な縞模様を避けたいときに使用できます。";"CIAffineTile" = "イメージに対してアフィン変形を適用し、そのイメージをタイル状に配置します。";"CIAffineTransform" = "イメージに対してアフィン変形を適用し、そのイメージを拡大縮小、変形、または回転することができます。これらの操作を組み合わせて適用することもできます。";"CIBarsSwipeTransition" = "前面イメージの矩形範囲からターゲットイメージが出現するように拭き取るようなエフェクトによって、ひとつのイメージから別のイメージに遷移します。";"CIBlendWithMask" = "グレースケールマスクの値を使用して対象イメージと背景イメージの間を補間します。マスク値が 0.0 の場合は結果として背景イメージが使用されます。マスク値が 1.0 の場合は結果として対象イメージが使用されます。";"CIBloom" = "輪郭をソフト化し気持ちのよい輝きをイメージに適用します。";"CIBoxBlur" = "ボックス形の畳み込みカーネルを使ってイメージをスムーズ化またはシャープ化します。";"CIBumpDistortion" = "イメージの指定したポイントに膨らみ（バンプ）を持たせます。バンプは、凹状または凸状にできます。";"CIBumpDistortionLinear" = "イメージの指定したポイントに膨らみ（バンプ）を持たせます。";"CICMYKHalftone" = "ページにシアン、マゼンタ、イエロー、およびブラックのインクを使用して、ソースイメージのハーフトーンを表現する色を生成します。";"CICheckerboardGenerator" = "チェッカーボードパターンを生成します。チェッカーボードのサイズ、色、およびパターンのシャープさを指定できます。";"CICircleSplashDistortion" = "円の中心から外側に向かって放射するようにピクセルを歪めます。";"CICircularScreen" = "環状ハーフトーンスクリーンを再現します。";"CICircularWrap" = "イメージを見えない円弧に沿った形で歪ませます。イメージの歪みは円の中心からの距離とともに大きくなります。";"CIColorControls" = "彩度、輝度、およびコントラストの値を調整します。";"CIColorCube" = "3 次元の色テーブルを使用して、ソースイメージピクセルを変換します。色テーブルは、プリマルチプライ済みアルファを使用する浮動小数点 RGBA セルで構成されている必要があります。セルは、標準の並びで構成されています。データの行列は、それぞれ赤とグリーンのインデックスが付きます。それぞれのデータプレーンは、データ中で次に高い位置のプレーンに続き、青のインデックスの付いたプレーンとなります。";"CIColorInvert" = "イメージの色を反転します。";"CIColorMap" = "テーブルに用意されたマッピング値を使用してソースの色値を非線形変換します。";"CIColorMatrix" = "ソースの色値を乗算し、各色成分にバイアス因子を加算します。";"CIColorMonochrome" = "単色の濃淡の範囲に収まるように、イメージの色をマップし直します。";"CIColorPosterize" = "赤、緑、および青の色成分を、各色成分に指定した輝度の数値にマップし直します。このフィルタは、色を平坦化して、シルクスクリーンポスターのような見た目にします。";"CIComicEffect" = "輪郭の濃淡をアウトライン化して描画し、色のハーフトーンエフェクトを適用することによって、漫画のようなイメージを再現します。";"CIConstantColorGenerator" = "無地の単色イメージを作成します。通常このフィルタの出力は別のフィルタへの入力として使われます。";"CICopyMachineTransition" = "コピー機のようなエフェクトを再現して、ひとつのイメージから別のイメージに遷移します。";"CICrop" = "イメージにクロップを適用します。クロップされるイメージのサイズと形は指定した矩形によって決まります。";"CICrystallize" = "ソースピクセルの色を合計してポリゴン状のカラーブロックを生成します。";"CIDiscBlur" = "ディスク形の畳み込みカーネルを使ってイメージをスムーズ化またはシャープ化します。";"CIDisintegrateWithMaskTransition" = "ひとつのイメージから別のイメージへ、マスクで定義した形状を使って遷移します。";"CIDisplacementDistortion" = "2 つめのイメージのグレースケールの値をソースとなる最初のイメージに適用します。出力イメージのテクスチャはグレースケールの値によって定義されます。";"CIDissolveTransition" = "ディゾルブ（フェードアウトとフェードインの同時実行）を使って 1 つのイメージを別のイメージに遷移します。";"CIDotScreen" = "ハーフトーンスクリーンの点パターンを再現します。";"CIEdges" = "イメージからすべての輪郭を検出してカラーで表示します。";"CIEdgeWork" = "木版画のようなイメージを図案化した単色イメージを生成します。";"CIEightfoldReflectedTile" = "ソースイメージに対して 8 方向の対称的な反射を適用したイメージを使ってタイルイメージを生成します。";"CIExposureAdjust" = "カメラの F ストップ値を変更して露光を操作するのと同じ方法で、露光設定を調整します。";"CIFalseColor" = "輝度を 2 色の色ランプにマップします。偽色は多くの場合、天文学や紫外線や X 線イメージなどの科学データを処理するのに使われます。";"CIFastBoxBlur" = "ボックス形の畳み込みカーネルを使ってイメージをスムーズ化またはシャープ化します。";"CIFastDiscBlur" = "ディスク形の畳み込みカーネルを使ってイメージをスムーズ化またはシャープ化します。";"CIFlashTransition" = "フラッシュを発光して、ひとつのイメージから別のイメージに遷移します。フラッシュは指定したポイントの位置で発生します。フラッシュは、最初に小さく、イメージフレームがフラッシュの色で完全に覆い尽くされるまで急激に拡大します。色がフェードによって薄れるにつれターゲットイメージが現れ始めます。";"CIFourfoldReflectedTile" = "ソースイメージに対して 4 方向の対称的な反射を適用したイメージを使ってタイルイメージを生成します。";"CIFourfoldRotatedTile" = "ソースイメージに対して 90 度ずつ回転させた 4 つのイメージを使ってタイルイメージを生成します。";"CIFourfoldTranslatedTile" = "ソースイメージに対して位置を 4 つずらしたイメージを使ってタイルイメージを生成します。";"CIGammaAdjust" = "中間調の輝度を調整します。このフィルタは通常、ディスプレイの非線形のエフェクトの補正に使用します。ガンマを調整するということは、黒と白の間の移り変わりの勾配を変えることを意味します。";"CIGaussianBlur" = "ガウス分布で指定する量だけソースピクセルを薄く引き延ばします。";"CIGaussianGradient" = "ガウス分布を使用してある色から別の色へ変化するグラデーションを生成します。";"CIGlassDistortion" = "ガラスのようなテクスチャを適用してイメージを歪ませます。出力イメージの突起はテクスチャマップを適用した結果です。";"CIGlassLozenge" = "菱形状のレンズを形成し、レンズを重ねたところのイメージの部分を歪ませます。";"CIGlideReflectedTile" = "ソースイメージに対して変形、不鮮明にしたイメージを使ってタイルイメージを生成します。";"CIGloom" = "イメージのハイライトを和らげます。";"CIHatchedScreen" = "ハーフトーンスクリーンのハッチ（線影）パターンを再現します。";"CIHeightFieldFromMask" = "グレースケールマスクに基づいて、連続的な立体感のあるロフト形状の高さフィールドを生成します。マスクの白色値は高さフィールドの内側にあるピクセルを定義し、黒色値は外側にあるピクセルを定義します。このフィールドはマスクの内側でスムーズかつ連続的に変化し、マスクの輪郭で値 0 になります。このフィルタを CIShadedMaterial フィルタと組み合わせて使用すると、きわめてリアルな陰影のあるオブジェクトを作成できます。";"CIHexagonalPixellate" = "イメージを 6 角形のブロック状にし、そのブロックごとに色を平坦化してモザイク状のエフェクトを生成します。";"CIHoleDistortion" = "イメージピクセルを外側に押し出す円形領域を作成し、円に最も近いピクセルとして歪ませます。";"CIHueAdjust" = "ソースピクセルの全体的な色相や色調を変えます。";"CIKaleidoscope" = "ソースイメージに対して 12 方向の対称的な反射を適用したイメージを使って万華鏡のようなイメージを生成します。";"CILanczosScaleTransform" = "ソースイメージを高品質に拡大縮小します。通常はイメージを縮小するフィルタとして使用されます。";"CILenticularHaloGenerator" = "レンズの広がりに対応する回折によって生成されるハローをシミュレートします。このフィルタは通常、レンズフレアおよび同様のエフェクトを再現するために別のイメージに適用されます。";"CILineOverlay" = "イメージの輪郭を黒色でアウトライン化し、イメージの透明な部分は非アウトライン化することで、スケッチ調のイメージを生成します。結果としてアルファチャンネルの追加と黒色による描画となり、ソース合成を使った別のイメージの描画とはまったく異なります。";"CILineScreen" = "ハーフトーンスクリーンの線パターンを再現します。";"CILinearGradient" = "定義した 2 つの端点間を直線軸に沿って変化するグラデーションを生成します。";"CIMaskToAlpha" = "グレースケールイメージをアルファでマスクされた白色イメージに変換します。ソースイメージの白色値はマスクの内側となり黒色値は完全な透明になります。";"CIMaximumCompositing" = "色成分ごとに 2 つの入力イメージの最大値を計算し、それらの最大値を使って出力イメージを作成します。これはドッジングに似たエフェクトです。";"CIMedianFilter" = "隣接するピクセルのグループの中央値を計算し、各ピクセル値をその中央値で置き換えます。これはノイズを軽減するエフェクトです。";"CIMinimumCompositing" = "色成分ごとに 2 つの入力イメージの最小値を計算し、それらの最小値を使って出力イメージを作成します。これはバーンに似たエフェクトです。";"CIModTransition" = "あるイメージから不規則な形状の穴を通してターゲットイメージを表示しながら遷移します。";"CIMotionBlur" = "イメージを捕らえたと同時に指定した角度と距離で移動するカメラを使ったようなエフェクトを再現したブラーをイメージに適用します。";"CIMultiplyCompositing" = "2 つの入力イメージの色成分を乗算し、それらの乗算値を使用して出力イメージを作成します。このフィルタは通常、スポットライトや似たような照明エフェクトを追加するのに使われます。";"CINoiseReduction" = "ノイズを定義するしきい値を使用してノイズを低減します。輝度の変化がしきい値よりも低ければノイズと見なされ、部分的なブラーとしてノイズ低減処理が適用されます。しきい値を超える変化はエッジと見なされてシャープ化されます。";"CIOpTile" = "イメージを分割し、指定した拡大縮小率と回転を適用し、イメージを組み立てなおしてオプティカルアートのような表現を作ります。";"CIPageCurlTransition" = "ページめくりの動作を再現し、ページをめくって新しいイメージを表示することで、あるイメージから別のイメージに遷移します。";"CIParallelogramTile" = "イメージを平行四辺形に歪めてその結果をタイル状に配置します。";"CIPerspectiveTile" = "パースペクティブ変形をイメージに適用してその結果をタイル状に配置します。";"CIPerspectiveTransform" = "観察者の視点の変化を再現するためにイメージの形状を変えます。遠近フィルターを使用して傾斜して歪められたイメージが得られます。";"CIPinchDistortion" = "ソースピクセルを内側につまむ矩形領域を作成し、その矩形領域に最も近いピクセルを歪ませます。";"CIPixellate" = "イメージをブロック状にします。";"CIPointillize" = "ソースイメージを点描スタイルで表現します。";"CIRadialGradient" = "2 つの同心円間を放射状に変化するグラデーションを生成します。2 つの円の一方を半径 0 に設定することも可能です。";"CIRandomGenerator" = " 0 〜 1 の範囲に均等に分布した 4 つの独立した乱数でピクセル値が構成される無限の大きさのイメージを生成します。";"CIRippleTransition" = "中心点から拡大する円形の波を作成し、波の跡を追って新しいイメージを表示することで、あるイメージから別のイメージへ遷移します。";"CISepiaTone" = "イメージの色をさまざまな茶色の濃淡にマップします。";"CIShadedMaterial" = "高さフィールドから陰影のあるイメージを生成します。高さフィールドは、高さが高くなるほど明るい色調になり、高さが低くなるほど（低い領域）暗い色調になるように定義されます。このフィルタと CIHeightFieldFromMask フィルタを組み合わせると、テキストなどのマスクに基づく陰影をすばやく生成できます。";"CISharpenLuminance" = "シャープ化によってイメージの細部を強調します。このフィルタはイメージの輝度に作用しますが、ピクセルのクロミナンスは影響を受けません。";"CISixfoldReflectedTile" = "ソースイメージに対して 6 方向の対称的な反射を適用したイメージを使ってタイルイメージを生成します。";"CISixfoldRotatedTile" = "ソースイメージに対して 60 度ずつ回転させた 4 つのイメージを使ってタイルイメージを生成します。";"CISourceAtopCompositing" = "フィルタは背景イメージの上にソースイメージを配置し、背景イメージの輝度を使用して表示対象を決定します。このエフェクトでは、背景イメージとソースイメージのうち背景イメージの目に見える部分に重なっている部分のみが表示されます。";"CISourceInCompositing" = "2 つめのイメージを使用して ソースイメージの中の残す部分を定義して、イメージをクロップします。";"CISourceOutCompositing" = "2 つめのイメージを使用して 1 つめのイメージの中の除外する部分を定義します。";"CISourceOverCompositing" = "1 つめのイメージの上に 2 つめのイメージを配置します。";"CISpotColor" = "ひとつ以上の色の範囲をスポット色で置き換えます。";"CISpotLight" = "指向性のスポットライトエフェクトをイメージに適用します。";"CIStarShineGenerator" = "星形パターンを生成します。出力イメージは通常別のフィルターの入力として使われます。";"CIStripesGenerator" = "縞模様パターンを生成します。縞模様の色や間隔、コントラストを設定できます。";"CISunbeamsGenerator" = "太陽光線を表現するエフェクトを生成します。太陽光線フィルターの出力は通常合成フィルターの入力として使われます。";"CISwipeTransition" = "スワイプ（拭い取り）動作の表現によってひとつのイメージから別のイメージへ遷移します。";"CITorusLensDistortion" = "円環型のレンズを生成し、それをソースイメージの上に重ねた時の重なった部分のイメージを歪ませます。";"CITriangleTile" = "イメージの三角形部分を三角の領域にマップし、その結果をタイル状に配置します。";"CITwelvefoldReflectedTile" = "ソースイメージに対して 12 方向の対称的な反射を適用したイメージを使ってタイルイメージを生成します。";"CITwirlDistortion" = "点を中心にピクセルを回転してらせん表現を生成します。エフェクトの対象となる中心位置と半径だけでなく回転数も指定できます。";"CIUnsharpMask" = "イメージの異なる色のピクセルの間にあるエッジのコントラストを高くします。";"CIVortexDistortion" = "点を中心にピクセルを回転して渦巻き表現を生成します。エフェクトの対象となる中心位置と半径だけでなく回転数も指定できます。";"CIWhitePointAdjust" = "イメージの基準ホワイトポイントを調整し、新しい基準を使用してソースイメージのすべての色をマップします。";"CIZoomBlur" = "イメージをカメラでズームしたようなエフェクトを表現します。";"CIColorBlendMode" = "ソースイメージの色調と彩度の値とともに、背景イメージの輝度値を使用します。このモードはイメージのグレーレベルが維持されます。";"CIColorBurnBlendMode" = "背景イメージサンプルを暗くして、ソースイメージサンプルを反映します。白を指定するソースイメージサンプル値は変化しません。";"CIColorDodgeBlendMode" = "背景イメージを明るくして、前景となるソースイメージサンプルを反映します。黒を指定するソースイメージのサンプル値は、変化を起こしません。";"CIDarkenBlendMode" = "ソースイメージまたは背景イメージのどちらか暗いほうを選択して合成イメージサンプルを生成します。結果として、背景イメージサンプルはそれらより暗いソースイメージサンプルで置き換えられます。それ以外の場合は、背景イメージサンプルは変更されません。";"CIDifferenceBlendMode" = "２つのイメージサンプルの輝度値の高さにより、背景イメージサンプル色からソースイメージサンプル色、あるいはその逆の減算処理を行います。ソースイメージのサンプル値が黒の場合は変化はありませんが、白の場合は背景色の値が反転します。";"CIExclusionBlendMode" = "CIDifferenceBlendMode と同じようなエフェクトをもたらしますが、コントラストが低くなります。ソースイメージのサンプル値が黒の場合は変化はありませんが、白の場合は背景色の値が反転します。";"CIHardLightBlendMode" = "ソースイメージのサンプル色に応じて、色の乗算またはスクリーニングします。ソースイメージのサンプルカラーが 50% のグレーより明るい場合は背景はスクリーニングのように明るくなります。50% のグレーより暗い場合は色の乗算処理のように暗くなります。50% のグレーと等しい場合はエフェクトはありません。イメージサンプルが純粋な黒または純粋な白の場合は、純粋な黒または白になります。エフェクトは全体として、ソースイメージに強いスポットライトを当てたような結果となります。";"CIHueBlendMode" = "背景イメージの輝度および彩度値を使ってブレンドしソースイメージの色相を変えます。";"CILightenBlendMode" = "ソースイメージまたは背景イメージのどちらか明るいほうを選択して合成イメージサンプルを生成します。結果として、背景イメージサンプルはそれらより明るいソースイメージサンプルで置き換えられます。それ以外の場合は、背景イメージサンプルは変更されません。";"CILuminosityBlendMode" = "背景イメージの色相と彩度およびソースイメージの輝度を使用します。このモードでは、CIColorBlendMode によって生じるエフェクトと逆のエフェクトが生じます。";"CIMultiplyBlendMode" = "ソースイメージのサンプルと背景イメージサンプルを乗算して、色が 2 つのサンプル色のどちらかと少なくとも同じ暗さのイメージを生成します。";"CIOverlayBlendMode" = "背景カラーに応じてソースイメージサンプルと背景イメージサンプルの乗算またはスクリーニングのどちらかを行います。結果として既存のイメージサンプルを背景のハイライトとシャドウを維持したまま重ね合わせます。背景カラーはソースイメージと混合して背景の明るさまたは暗さを反映します。";"CISaturationBlendMode" = "背景イメージの輝度値と色相値およびソースイメージの彩度を使用します。背景の中で彩度のない領域（純粋なグレーの領域）では、変化は生じません。";"CIScreenBlendMode" = "ソースイメージのサンプルと背景イメージサンプルを乗算して、色が 2 つのサンプル色のどちらかと少なくとも同じ明るさのイメージを生成します。";"CISoftLightBlendMode" = "ソースイメージサンプルカラーに応じて色を暗くまたは明るくします。ソースイメージサンプルカラーが 50% のグレーより明るい場合はドッジのように背景が明るくなります。50% のグレーより暗い場合はバーンのように背景が暗くなります。50% のグレーと等しい場合はエフェクトはありません。イメージサンプルが純粋な黒または純粋な白の場合は領域が暗くなるか明るくなりますが、純粋な黒または白にはなりません。エフェクトは全体として、ソースイメージに拡散したスポットライトを当てたような結果となります。";"outputImage" = "フィルターによって生成されたイメージ。";"inputBackgroundImage" = "背景イメージとして使われるイメージ。";"inputImage" = "入力イメージとして使われるイメージ。フィルターによっては背景イメージとしても使われますが、通常は前景となるソースイメージです。";"inputTime" = "エフェクトが完了するまでの時間。";"inputTransform" = "適用する変形の指定。";"inputScale" = "エフェクトのかかり具合。";"inputAspectRatio" = "アスペクト比。";"inputCenter" = "エフェクト領域の中心を示す x および y 座標。";"inputRadius" = "エフェクトの中心点からの距離。";"inputAngle" = "角度。";"inputRefraction" = "エフェクトで使われる（ガラスのような）物質の反射インデクス。";"inputWidth" = "エフェクトが起こる領域の幅。";"inputSharpness" = "イメージに適用するシャープ化の量。";"inputIntensity" = "エフェクトの強さ。";"inputEV" = "作成するイメージの F ストップの明るさまたは暗さを示す数値。";"inputSaturation" = "彩度を調整する値。";"inputColor" = "色。";"inputBrightness" = "輝度レベル。";"inputContrast" = "コントラストレベル。";"inputGradientImage" = "アルファチャンネルの環境マップ。通常ハイライトとシャドウのあるイメージです。";"inputMaskImage" = "マスクイメージ。";"inputShadingImage" = "アルファチャンネルの環境マップ。通常ハイライトとシャドウのあるイメージです。";"inputTargetImage" = "イメージ遷移でのターゲットとなるイメージ。";"inputExtent" = "エフェクトが適用される領域を定義した矩形。";"CIBoxBlur.inputRadius" = "ブラーを作成するのに使われるピクセルを算出するための領域の半径。半径を大きくすれば強いブラーエフェクトが得られます。";"CIDiscBlur.inputRadius" = "ブラーを作成するのに使われるピクセルを算出するための領域の半径。半径を大きくすれば強いブラーエフェクトが得られます。";"CIGaussianBlur.inputRadius" = "ブラーを作成するのに使われるピクセルを算出するための領域の半径。半径を大きくすれば強いブラーエフェクトが得られます。";"CIMotionBlur.inputRadius" ="ブラーを作成するのに使われるピクセルを算出するための領域の半径。半径を大きくすれば強いブラーエフェクトが得られます。";"CIMotionBlur.inputAngle" = "移動の角度はブラーによって不鮮明になる方向を決定します。";"CINoiseReduction.inputNoiseLevel" = "ノイズ低減の量。値を大きくすればノイズが低減されます。";"CINoiseReduction.inputSharpness" = "最終イメージのシャープさ。値を大きくすればシャープな結果が得られます。";"CIZoomBlur.inputCenter" = "エフェクト領域の中心を示す x および y 座標。";"CIZoomBlur.inputAmount" = "ズームインの量。値が大きいほどより強いズームインエフェクトが得られます。";"CIColorControls.inputSaturation" = "適用する彩度の量。値を大きくすれば鮮やかな結果が得られます。";"CIColorControls.inputBrightness" = "適用する輝度の量。値を大きくすれば明るい結果が得られます。";"CIColorControls.inputContrast" = "適用するコントラストの量。値を大きくすればコントラストのはっきりした結果が得られます。";"CIColorMatrix.inputRVector" = "ソースの色値を乗算するための赤色の成分量。";"CIColorMatrix.inputGVector" = "ソースの色値を乗算するための緑色の成分量。";"CIColorMatrix.inputBVector" = "ソースの色値を乗算するための青色の成分量。";"CIColorMatrix.inputAVector" = "ソースの色値を乗算するためのアルファ色の成分量。";"CIColorMatrix.inputBiasVector" = "各色成分に追加するベクター値。";"CIExposureAdjust.inputEV" = "イメージの露光を調整する値。値を大きくすれば露光の明るい結果が得られます。";"CIGammaAdjust.inputPower" = "イメージの輝度を補正するのに使うガンマ値。値を大きくすれば暗い結果が得られます。";"CIHueAdjust.inputAngle" = "イメージの色相を補正するのに使う角度（度数）。";"CIWhitePointAdjust.inputColor" = "ホワイトポイントとして使われる色。";"CIColorCube.inputDimension" = "色テーブルの次元。";"CIColorCube.inputCubeData" = "これは、プリマルチプライ済みアルファを使用する浮動小数点 RGBA セルの色テーブルです。セルは、標準の並びで構成されています。データの行列は、それぞれ赤とグリーンのインデックスが付きます。それぞれのデータプレーンは、データ中で次に高い位置のプレーンに続き、青のインデックスの付いたプレーンとなります。";"CIColorMap.inputGradientImage" = "このイメージからのイメージデータはソースイメージの値に変換します。";"CIColorMonochrome.inputColor" = "イメージに適用する単色の指定。";"CIColorMonochrome.inputIntensity" = "単色エフェクトの強さ。値が 1.0 の場合は指定された色を元に単色イメージを作成します。値が 0.0 の場合はエフェクトがありません。";"CIColorPosterize.inputLevels" = "各色成分に使われる輝度レベルの数値。値が小さいほどより強いポスターエフェクトの結果が得られます。";"CIFalseColor.inputColor0" = "色ランプに使う最初の色。";"CIFalseColor.inputColor1" = "色ランプに使う 2 番目の色。";"CISepiaTone.inputIntensity" = "セピアエフェクトの強さ。値が 1.0 の場合は単色のセピアイメージが生成されます。値が 0.0 の場合はエフェクトはありません。";"CIBumpDistortion.inputCenter" = "バンプの中心を示す x および y 座標。"; "CIBumpDistortion.inputRadius" = "歪みを作成するのに使われるピクセルを算出するための領域の半径。半径を大きくすれば広い領域に歪みエフェクトが適用されます。"; "CIBumpDistortion.inputScale" = "膨らみ度合いを示す値。値が 0.0 の場合はエフェクトがありません。正数は外向き（凸状）のバンプ、負数は内向き（凹状）のバンプが得られます。"; "CIBumpDistortionLinear.inputCenter" = "歪み領域の中心を示す x および y 座標。"; "CIBumpDistortionLinear.inputRadius" = "歪みを作成するのに使われるピクセルを算出するための領域の半径。半径を大きくすれば広い領域に歪みエフェクトが適用されます。";  "CIBumpDistortionLinear.inputScale" = "エフェクトの度合いを示す値。"; "CIBumpDistortionLinear.inputAngle" = "歪みが発生する周囲の線の角度（度数）。"; "CICircleSplashDistortion.inputCenter" = "歪み領域の中心を示す x および y 座標。";  "CICircleSplashDistortion.inputRadius" = "歪みを作成するのに使われるピクセルを算出するための領域の半径。半径を大きくすれば広い領域に歪みエフェクトが適用されます。";  "CICircularWrap.inputCenter" = "歪み領域の中心を示す x および y 座標。";  "CICircularWrap.inputRadius" = "歪みを作成するのに使われるピクセルを算出するための領域の半径。半径を大きくすれば広い領域に歪みエフェクトが適用されます。";  "CICircularWrap.inputAngle" = "エフェクトを行う円弧の角度。"; "CIDisplacementDistortion.inputDisplacementImage" = "グレースケールの値をソースイメージに適用するイメージ。"; "CIDisplacementDistortion.inputScale" = "結果となるイメージのテクスチャの量。値を大きくすればテクスチャの影響が大きくなります。"; "CIGlassDistortion.inputTexture" = "ソースイメージに適用するテクスチャ。";"CIGlassDistortion.inputCenter" = "歪み領域の中心を示す x および y 座標。"; "CIGlassDistortion.inputScale" = "結果となるイメージのテクスチャの量。値を大きくすればテクスチャの影響が大きくなります。"; "CIGlassLozenge.inputPoint0" = "菱形の片方の端に発生する円の中心を示す x および y 座標。"; "CIGlassLozenge.inputPoint1" = "菱形のもう片方の端に発生する円の中心を示す x および y 座標。";  "CIGlassLozenge.inputRadius" = "菱形の厚み。値を大きくすれば歪みが拡張されて広がります。";  "CIGlassLozenge.inputRefraction" = "菱形状ガラスレンズの屈折率。"; "CIHoleDistortion.inputCenter" = "歪み領域の中心を示す x および y 座標。";  "CIHoleDistortion.inputRadius" = "歪みを作成するのに使われるピクセルを算出するための領域の半径。半径を大きくすれば広い領域に歪みエフェクトが適用されます。";  "CIPinchDistortion.inputCenter" = "歪み領域の中心を示す x および y 座標。"; "CIPinchDistortion.inputRadius" = "歪みを作成するのに使われるピクセルを算出するための領域の半径。半径を大きくすれば広い領域に歪みエフェクトが適用されます。"; "CIPinchDistortion.inputScale" = "つまみの量。値が 1.0 の場合はエフェクトはなく、値が 0.0 の場合は最大のつまみエフェクトが得られます。";"CITorusLensDistortion.inputCenter" = "円環の中心を示す x および y 座標。";  "CITorusLensDistortion.inputRadius" = "円環の外周半径。";  "CITorusLensDistortion.inputWidth" = "円環の幅。"; "CITorusLensDistortion.inputRefraction" = "菱形状ガラスレンズの屈折率。"; "CITwirlDistortion.inputCenter" = "歪み領域の中心を示す x および y 座標。";  "CITwirlDistortion.inputRadius" = "歪みを作成するのに使われるピクセルを算出するための領域の半径。半径を大きくすれば広い領域に歪みエフェクトが適用されます。"; "CITwirlDistortion.inputAngle" = "らせんの角度（度数）。正または負の値です。";"CIVortexDistortion.inputCenter" = "歪み領域の中心を示す x および y 座標。"; "CIVortexDistortion.inputRadius" = "歪みを作成するのに使われるピクセルを算出するための領域の半径。半径を大きくすれば広い領域に歪みエフェクトが適用されます。"; "CIVortexDistortion.inputAngle" = "渦巻きの角度（度数）。";"CICheckerboardGenerator.inputColor0" = "1 つめのチェッカーボードの四角に使用する色。";"CICheckerboardGenerator.inputColor1" = "2 つめのチェッカーボードの四角に使用する色。";"CICheckerboardGenerator.inputWidth" = "チェッカーボードで使われる四角の幅です。";"CICheckerboardGenerator.inputSharpness" = "チェッカーボードのシャープさを指定する値。値が小さいほどパターンがぼやけます。範囲は 0.0 〜 1.0 です。";"CIConstantColorGenerator.inputColor" = "生成する色。"; "CILenticularHaloGenerator.inputCenter" = "ハロー効果の中心を示す x および y 座標。";"CILenticularHaloGenerator.inputHaloRadius" = "ハローの半径。";"CILenticularHaloGenerator.inputHaloWidth" = "内側と外側の円の半径との距離、ハローの幅。";"CILenticularHaloGenerator.inputOverlap" = "ハローによって生じる回折の重なり合う量。値が 1.0 の場合は完全に重なり合い、ハローは白くなります。値が 0.0 の場合は重なり合いません。";"CILenticularHaloGenerator.inputStriationStrength" = "ハロー模様の色の強さ。値を大きくすれば、より強いハローエフェクトが得られます。";"CILenticularHaloGenerator.inputStriationContrast" = "ハロー模様の色のコントラスト。値を大きくすれば、より高いコントラストが得られます。";"CIStarShineGenerator.inputCenter" = "星形パターンの中心を示す x および y 座標。"; "CIStarShineGenerator.inputColor" = "星形パターンの外周位置に使われる光の色。"; "CIStarShineGenerator.inputRadius" = "星形パターンの半径。"; "CIStarShineGenerator.inputCrossScale" = "星形パターンの突出した光の大きさ。"; "CIStarShineGenerator.inputCrossAngle" = "星形パターンの回転角。"; "CIStarShineGenerator.inputCrossOpacity" = "星形パターンの不透明さ。"; "CIStarShineGenerator.inputCrossWidth" = "星形パターンの突出した光の部分の幅。"; "CIStarShineGenerator.inputEpsilon" = "星形パターンの突出した光の部分の長さ。"; "CIStripesGenerator.inputCenter" = "ストライプパターンの中心を示す x および y 座標。"; "CIStripesGenerator.inputColor0" = "縞模様パターンの偶数番目に使われる色。"; "CIStripesGenerator.inputColor1" = "縞模様パターンの奇数番目に使われる色。";"CIStripesGenerator.inputWidth" = "縞模様の幅。"; "CIStripesGenerator.inputSharpness" = "縞模様パターンのシャープさを指定する値。値が小さいほどパターンがぼやけます。値の範囲は 0.0 と 1.0 の間です。"; "CISunbeamsGenerator.inputCenter" = "太陽光線パターンの中心を示す x および y 座標。";"CISunbeamsGenerator.inputColor" = "太陽部分の色。";"CISunbeamsGenerator.inputSunRadius" = "太陽部分の半径。";"CISunbeamsGenerator.inputMaxStriationRadius" = "太陽光線の半径。";"CISunbeamsGenerator.inputStriationStrength" = "太陽光線の強さ。高い値の場合はより強い強烈な光になります。";"CISunbeamsGenerator.inputStriationContrast" = "太陽光線のコントラスト。高い値の場合はより高いコントラストが得られます。";"CIAffineTransform.inputTransform" = "イメージに適用する変形の指定。"; "CICrop.inputRectangle" = "イメージにクロップを適用する矩形。"; "CILanczosScaleTransform.inputScale" = "イメージのエフェクトに必要なスケール要素。値が 1.0 以下の場合は縮小になり、1.0 以上だとイメージの拡大になります。"; "CILanczosScaleTransform.inputAspectRatio" = "イメージのアスペクト比。"; "CIPerspectiveTransform.inputTopLeft" = "イメージのマップ先の左上隅の位置。"; "CIPerspectiveTransform.inputTopRight" = "イメージのマップ先の右上隅の位置。"; "CIPerspectiveTransform.inputBottomRight" = "イメージのマップ先の左下隅の位置。"; "CIPerspectiveTransform.inputBottomLeft" = "イメージのマップ先の左下隅の位置。"; "CIGaussianGradient.inputColor0" = "グラデーションで使用する 1 つめの色。"; "CIGaussianGradient.inputColor1" = "グラデーションで使用する 2 つめの色。"; "CIGaussianGradient.inputRadius" = "ガウス分布の標準偏差の値。"; "CILinearGradient.inputPoint0" = "グラデーションの開始点位置（1 つめの色のある場所）。"; "CILinearGradient.inputPoint1" = "グラデーションの終点位置（2 つめの色のある場所）。"; "CILinearGradient.inputColor0" = "グラデーションで使用する 1 つめの色。";  "CILinearGradient.inputColor1" = "グラデーションで使用する 2 つめの色。";  "CIRadialGradient.inputRadius0" = "グラデーションで使われる開始円の半径。";"CIRadialGradient.inputRadius1" = "グラデーションで使われる終了円の半径。";"CIRadialGradient.inputColor0" = "グラデーションで使用する 1 つめの色。";  "CIRadialGradient.inputColor1" = "グラデーションで使用する 2 つめの色。"; "CICircularScreen.inputCenter" = "円形スクリーンパターンの中心を示す x および y 座標。"; "CICircularScreen.inputWidth" = "環状パターンにおける各円弧の間の距離。"; "CICircularScreen.inputSharpness" = "円弧のシャープさを指定する値。値を大きくすれば円弧がシャープになります。"; "CICMYKHalftone.inputCenter" = "ハーフトーンパターンの中心を示す x および y 座標。";  "CICMYKHalftone.inputWidth" = "パターンのドット間の距離。"; "CICMYKHalftone.inputAngle" = "パターンの角度。"; "CICMYKHalftone.inputSharpness" = "パターンのシャープさを指定する値。値が大きいほどパターンがシャープになります。"; "CICMYKHalftone.inputGCR" = "グレー置き換え（GCR）の値。範囲は 0.0（なし）〜 1.0 です。"; "CICMYKHalftone.inputUCR" = "下色除去（UCR）の値。範囲は 0.0 〜 1.0 です。"; "CIDotScreen.inputCenter" = "ドットスクリーンパターンの中心を示す x および y 座標。";  "CIDotScreen.inputAngle" = "パターンの角度。"; "CIDotScreen.inputWidth" = "パターンのドット間の距離。"; "CIDotScreen.inputSharpness" = "パターンのシャープさを指定する値。値が大きいほどパターンがシャープになります。"; "CIHatchedScreen.inputCenter" = "ハッチスクリーンパターンの中心を示す x および y 座標。"; "CIHatchedScreen.inputAngle" = "パターンの角度。";"CIHatchedScreen.inputWidth" = "パターンのライン間の距離。"; "CIHatchedScreen.inputShaprness" = "パターンのシャープさを指定する値。値が大きいほどパターンがシャープになります。"; "CILineScreen.inputCenter" = "ラインスクリーンパターンの中心を示す x および y 座標。";  "CILineScreen.inputAngle" = "パターンの角度。"; "CILineScreen.inputWidth" = "パターンのライン間の距離。"; "CILineScreen.inputSharpness" = "パターンのシャープさを指定する値。値が大きいほどパターンがシャープになります。"; 	"CISharpenLuminance.inputSharpness" = "イメージに適用するシャープ化の量。大きな値ほどシャープなイメージが得られます。";"CIUnsharpMask.inputRadius" = "与えられたピクセルの周りの半径で、アンシャープマスクに適用します。半径が大きい場合はより高いエフェクトが得られます。";"CIUnsharpMask.inputIntensity" = "エフェクトの強さ。値を大きくすれば対象領域でより高いコントラストが得られます。";"CIBlendWithMask.inputMaskImage" = "補間に使用するグレースケールのマスクイメージ。マスク値が 0.0 の場合は結果として背景イメージが使用されます。マスク値が 1.0 の場合は結果として対象イメージが使用されます。"; "CIBloom.inputRadius" = "エフェクトを作成するのに使われるピクセルを算出するための領域の半径。半径を大きくすれば強いエフェクトが得られます。";"CIBloom.inputIntensity" = "エフェクトの強さ。値が 0.0 の場合はエフェクトがありません。値が 1.0 だと最大のエフェクトが得られます。"; "CICrystallize.inputRadius" = "エフェクトを作成するのに使われるピクセルを算出するための領域の半径。半径を大きくすれば広い領域にクリスタルエフェクトが適用されます。"; "CIEdges.inputIntensity" = "輪郭の強さ。値を大きくすれば高いエフェクトが得られます。"; "CIEdgeWork.inputRadius" = "輪郭の太さ。値を大きくすれば太い輪郭が得られます。"; "CIGloom.inputRadius" = "エフェクトを作成するのに使われるピクセルを算出するための領域の半径。半径を大きくすれば強いエフェクトが得られます。"; "CIGloom.inputIntensity" = "エフェクトの強さ。値が 0.0 の場合はエフェクトがありません。値が 1.0 だと最大のエフェクトが得られます。"; "CIHeightFieldFromMask.inputImage" = "マスクの白色値は高さフィールドの内側にあるピクセルを定義し、黒色値は外側にあるピクセルを定義します。このフィールドはマスクの内側でスムーズかつ連続的に変化し、マスクの輪郭で値 0 になります。"; "CIHeightFieldFromMask.inputRadius" = "スムーズな遷移に対してマスクのエッジからの距離は入力半径と比例します。値を大きくすれば、よりスムーズかつ力強い遷移のエフェクトが得られます。値を小さくすれば遷移は曲率が近似されたものになります。"; "CIHexagonalPixellate.inputCenter" = "エフェクト領域の中心を示す x および y 座標。"; "CIHexagonalPixellate.inputScale" = "6 角形ブロックのサイズを算出するための値。値を大きくすれば、より大きな 6 角形ブロックが得られます。"; "CILineOverlay.inputNRNoiseLevel" = "イメージの輪郭を抽出する前に削除される（カメラデータを使った）イメージのノイズレベル。ノイズレベルをあげると抽出したイメージの輪郭を奇麗に抽出してくれます。"; "CILineOverlay.inputNRSharpness" = "イメージの輪郭を抽出する前にノイズを除去する時に行われるシャープ化の量。これは輪郭の抽出精度を向上します。"; "CILineOverlay.inputEdgeIntensity" = "イメージの輪郭を抽出する時のゾーベルグラディエント情報の強さを示す値。値が高い場合はより多くの輪郭が得られますが、通常は低い値（1.0など）が使われます。"; "CILineOverlay.inputThreshold" = "輪郭の出現度合いを示す値。値を大きくすれば、より希薄化された輪郭となります。"; "CILineOverlay.inputContrast" = "このフィルターによって生成される輪郭に使うためのアンチエイリアスの量。値が高い場合はコントラストの高い輪郭（アンチエイリアスが少ない）が得られます。"; "CIPixellate.inputCenter" = "エフェクト領域の中心を示す x および y 座標。";  "CIPixellate.inputScale" = "四角形ブロックのサイズを算出するための値。値を大きくすれば、より大きな四角形ブロックが得られます。"; "CIPointillize.inputRadius" = "点描するときの点の円の半径。"; "CIPointillize.inputCenter" = "エフェクト領域の中心を示す x および y 座標。";  "CIShadedMaterial.inputShadingImage" = "高さフィールドとして使うイメージ。結果として、高さが高くなるほど明るい色調になり、高さが低くなるほど（低い領域）暗い色調になります。"; "CIShadedMaterial.inputScale" = "得られるエフェクトの強さ。値が高いほど、より効果的な高さが強調されたエフェクトが得られます。"; "CISpotColor.inputCenterColor1" = "置き換えるための 1 つめの色の範囲の中心。"; "CISpotColor.inputReplacementColor1" = "1 つめの色範囲に対する置き換える色。"; "CISpotColor.inputCloseness1" = "置き換える前の 1 つめの色がどのくらい近似してマッチすべきかを示す値。"; "CISpotColor.inputContrast1" = "1 つめの置き換える色のコントラスト。"; "CISpotColor.inputCenterColor2" = "置き換えるための 2 つめの色の範囲の中心。"; "CISpotColor.inputReplacementColor2" = "2 つめの色範囲に対する置き換える色。";"CISpotColor.inputCloseness2" = "置き換える前の 2 つめの色がどのくらい近似してマッチすべきかを示す値。"; "CISpotColor.inputContrast2" = "2 つめの置き換える色のコントラスト。"; "CISpotColor.inputCenterColor3" = "置き換えるための 3 つめの色の範囲の中心。";  "CISpotColor.inputReplacementColor3" = "3 つめの色範囲に対する置き換える色。"; "CISpotColor.inputCloseness3" = "置き換える前の 3 つめの色がどのくらい近似してマッチすべきかを示す値。";  "CISpotColor.inputContrast3" = "3 つめの置き換える色のコントラスト。";  "CISpotLight.inputLightPosition" = "スポットライト光源の位置を示す x および y 座標。"; 		"CISpotLight.inputLightPointsAt" = "スポットライトの当たる領域の中心を示す x および y 座標。";  "CISpotLight.inputBrightness" = "スポットライトの輝度。"; "CISpotLight.inputConcentration" = "スポットライトのサイズ。値が小さいほどより範囲の狭い、フォーカスされた光源となります。"; "CISpotLight.inputColor" = "スポットライトの色。"; "CIAffineClamp.inputTransform" = "イメージに適用する変形の指定。"; "CIAffineTile.inputTransform" = "イメージに適用する変形の指定。"; "CIEightfoldReflectedTile.inputCenter" = "エフェクト領域の中心を示す x および y 座標。";  "CIEightfoldReflectedTile.inputAngle" = "タイルパターンの角度（度数）。"; "CIEightfoldReflectedTile.inputWidth" = "タイルの幅。"; "CIFourfoldReflectedTile.inputCenter" = "エフェクト領域の中心を示す x および y 座標。";  "CIFourfoldReflectedTile.inputAngle" = "タイルパターンの角度（度数）。";  "CIFourfoldReflectedTile.inputAcuteAngle" = "反射したタイルを繰り返すこのエフェクトの主となる角度。値が低いと薄いダイアモンド形のタイルが生成され、高い場合には平坦な反射したタイルが生成されます。"; "CIFourfoldReflectedTile.inputWidth" = "タイルの幅。";  "CIFourfoldRotatedTile.inputCenter" = "エフェクト領域の中心を示す x および y 座標。";  "CIFourfoldRotatedTile.inputAngle" = "タイルパターンの角度（度数）。";  "CIFourfoldRotatedTile.inputWidth" = "タイルの幅。"; "CIFourfoldTranslatedTile.inputCenter" = "エフェクト領域の中心を示す x および y 座標。";  "CIFourfoldTranslatedTile.inputAngle" = "タイルパターンの角度（度数）。";  "CIFourfoldTranslatedTile.inputAcuteAngle" = "位置を変えたタイルを繰り返すこのエフェクトの主となる角度。値が低いと薄いダイアモンド形のタイルが生成され、高い場合には平坦な位置を変えたタイルが生成されます。"; "CIFourfoldTranslatedTile.inputWidth" = "タイルの幅。";  "CIGlideReflectedTile.inputCenter" = "エフェクト領域の中心を示す x および y 座標。";  "CIGlideReflectedTile.inputAngle" = "タイルパターンの角度（度数）。";  "CIGlideReflectedTile.inputWidth" = "タイルの幅。";  "CIKaleidoscope.inputCount" = "パターンの反射数。"; "CIKaleidoscope.inputCenter" = "エフェクト領域の中心を示す x および y 座標。";  "CIKaleidoscope.inputAngle" = "反射イメージの角度。"; "CIOpTile.inputCenter" = "エフェクト領域の中心を示す x および y 座標。";  "CIOpTile.inputScale" = "エフェクトのタイル数を算出するための値。"; "CIOpTile.inputAngle" = "タイルの回転する角度。"; "CIOpTile.inputWidth" = "タイルの幅。"; "CIParallelogramTile.inputCenter" = "エフェクト領域の中心を示す x および y 座標。"; "CIParallelogramTile.inputAngle" = "タイルパターンの角度（度数）。";  "CIParallelogramTile.inputAcuteAngle" = "平行四辺形のタイルを繰り返すこのエフェクトの主となる角度。値が低いと薄いダイアモンド形のタイルが生成され、高い場合には平坦な平行四辺形タイルが生成されます。"; "CIParallelogramTile.inputWidth" = "タイルの幅。";  "CIPerspectiveTile.inputTopLeft" = "タイルの左上隅の位置。"; "CIPerspectiveTile.inputTopRight" = "タイルの右上隅の位置。";"CIPerspectiveTile.inputBottomRight" = "タイルの右下隅の位置。"; "CIPerspectiveTile.inputBottomLeft" = "タイルの左下隅の位置。"; "CISixfoldReflectedTile.inputCenter" = "エフェクト領域の中心を示す x および y 座標。";  "CISixfoldReflectedTile.inputAngle" = "タイルパターンの角度（度数）。";  "CISixfoldReflectedTile.inputWidth" = "タイルの幅。"; "CISixfoldRotatedTile.inputCenter" = "エフェクト領域の中心を示す x および y 座標。"; "CISixfoldRotatedTile.inputAngle" = "タイルパターンの角度（度数）。";  "CISixfoldRotatedTile.inputWidth" = "タイルの幅。";  "CITriangleTile.inputCenter" = "エフェクト領域の中心を示す x および y 座標。";  "CITriangleTile.inputAngle" = "タイルパターンの角度（度数）。";  "CITriangleTile.inputWidth" = "タイルの幅。";  "CITwelvefoldReflectedTile.inputCenter" = "エフェクト領域の中心を示す x および y 座標。"; "CITwelvefoldReflectedTile.inputAngle" = "タイルパターンの角度（度数）。";"CITwelvefoldReflectedTile.inputWidth" = "タイルの幅。"; "CIBarsSwipeTransition.inputAngle" = "遷移するバーの角度（度数）。";	"CIBarsSwipeTransition.inputWidth" = "遷移するそれぞれのバーの幅。";	"CIBarsSwipeTransition.inputBarOffset" = "遷移するそれぞれの関連するバーのオフセット値。";	"CIBarsSwipeTransition.inputTime" = "イメージ遷移に必要な時間を指定するための値。開始（時間 0）から終了（時間 1）にかけて遷移します。";"CICopyMachineTransition.inputColor" = "コピー機のライトの色。";"CICopyMachineTransition.inputAngle" = "コピー機のライトを表示する角度。";"CICopyMachineTransition.inputWidth" = "コピー機のライトの幅。";"CICopyMachineTransition.inputOpacity" = "コピー機のライトの不透明度。値が 0.0 の場合は透明になり、1.0 だと不透明になります。";"CICopyMachineTransition.inputTime" = "イメージ遷移に必要な時間を指定するための値。開始（時間 0）から終了（時間 1）にかけて遷移します。";"CIDisintegrateWithMaskTransition.inputMaskImage" = "ソースからターゲットイメージに遷移するときに使われる形状を定義したイメージ。";"CIDisintegrateWithMaskTransition.inputShadowRadius" = "マスクが生成する影の半径。";"CIDisintegrateWithMaskTransition.inputShadowDensity" = "マスクが生成する影の濃さ。";"CIDisintegrateWithMaskTransition.inputShadowOffset" = "マスクが生成する影のオフセット。";"CIDisintegrateWithMaskTransition.inputTime" = "イメージ遷移に必要な時間を指定するための値。開始（時間 0）から終了（時間 1）にかけて遷移します。";"CIDissolveTransition.inputTime" = "イメージ遷移に必要な時間を指定するための値。開始（時間 0）から終了（時間 1）にかけて遷移します。";"CIFlashTransition.inputCenter" = "エフェクト領域の中心を示す x および y 座標。"; "CIFlashTransition.inputExtent" = "フラッシュの発生する範囲。";"CIFlashTransition.inputColor" = "フラッシュが発光する光線の色。";"CIFlashTransition.inputMaxStriationRadius" = "フラッシュが発光する光線の半径。";"CIFlashTransition.inputStriationStrength" = "フラッシュが発光する光線の強さ。";"CIFlashTransition.inputStriationContrast" = "フラッシュが発光する光線のコントラスト。";"CIFlashTransition.inputFadeThreshold" = "フラッシュとターゲットイメージの間でのフェードの強さ。値が高いほど、長いフラッシュ時間とフェードが行われる時間が短くなります。";"CIFlashTransition.inputTime" = "イメージ遷移に必要な時間を指定するための値。開始（時間 0）から終了（時間 1）にかけて遷移します。";"CIModTransition.inputCenter" = "エフェクト領域の中心を示す x および y 座標。"; "CIModTransition.inputAngle" = "穴のパターンの角度。";"CIModTransition.inputRadius" = "パターンの中の歪んだ穴の半径（大きさ）。";"CIModTransition.inputCompression" = "穴のパターンに適用する圧縮の度合い。イメージの輪郭と同じぐらい中央の穴は歪みません。";"CIModTransition.inputTime" = "イメージ遷移に必要な時間を指定するための値。開始（時間 0）から終了（時間 1）にかけて遷移します。";"CIPageCurlTransition.inputBacksideImage" = "ページをめくってターゲットイメージが現れた時に、ソースイメージの背面として見えるイメージ。";"CIPageCurlTransition.inputShadingImage" = "四角形に収まる陰影のある球体のようなイメージ。";"CIPageCurlTransition.inputExtent" = "エフェクトが適用される領域。";"CIPageCurlTransition.inputAngle" = "ページめくりの角度。";"CIPageCurlTransition.inputRadius" = "ページめくりの半径。";"CIPageCurlTransition.inputTime" = "イメージ遷移に必要な時間を指定するための値。開始（時間 0）から終了（時間 1）にかけて遷移します。";"CIRippleTransition.inputShadingImage" = "四角形に収まる陰影のある球体のようなイメージ。";"CIRippleTransition.inputCenter" = "エフェクト領域の中心を示す x および y 座標。"; "CIRippleTransition.inputExent" = "エフェクトが適用される領域。";"CIRippleTransition.inputWidth" = "波紋の幅。";"CIRippleTransition.inputScale" = "波紋が開始する突起（値が高い時）またはくぼみ（値が低い時）を決定するための値";"CIRippleTransition.inputTime" = "イメージ遷移に必要な時間を指定するための値。開始（時間 0）から終了（時間 1）にかけて遷移します。";"CISwipeTransition.inputExtent" = "エフェクトが適用される領域。";"CISwipeTransition.inputColor" = "スワイプの色。";"CISwipeTransition.inputAngle" = "スワイプの角度。";"CISwipeTransition.inputWidth" = "スワイプの幅。";"CISwipeTransition.inputOpacity" = "スワイプの不透明さ。";"CISwipeTransition.inputTime" = "イメージ遷移に必要な時間を指定するための値。開始（時間 0）から終了（時間 1）にかけて遷移します。";"CIAreaHistogram" = "イメージ内の指定領域のヒストグラムを計算して、1D イメージで結果を返します。";"CIAreaHistogram.inputExtent" = "処理対象イメージのサブリージョンを指定する長方形。";"CIAreaHistogram.inputCount" = "ヒストグラムの区間数（ビン数）。";"CIAreaHistogram.inputImage" = "ヒストグラムの計算対象イメージ。";"CIAreaHistogram.inputScale" = "ヒストグラム値として使用するスケール値。";"CIAreaMaximum" = "イメージ内の指定領域の最大成分値を計算して、1 ピクセルで結果を返します。";"CIAreaMaximum.inputExtent" = "処理対象イメージのサブリージョンを指定する長方形。";"CIAreaMaximum.inputImage" = "処理対象イメージ。";"CIAreaMinimum" = "イメージ内の指定領域の最小成分値を計算して、1 ピクセルで結果を返します。";"CIAreaMinimum.inputExtent" = "処理対象イメージのサブリージョンを指定する長方形。";"CIAreaMinimum.inputImage" = "処理対象イメージ。";"CIAreaMaximumAlpha" = "最大アルファ値を持つピクセルを検出して返します。";"CIAreaMaximumAlpha.inputExtent" = "処理対象イメージのサブリージョンを指定する長方形。";"CIAreaMaximumAlpha.inputImage" = "処理対象イメージ。";"CIAreaMinimumAlpha" = "最小アルファ値を持つピクセルを検出して返します。";"CIAreaMinimumAlpha.inputExtent" = "処理対象イメージのサブリージョンを指定する長方形。";"CIAreaMinimumAlpha.inputImage" = "処理対象イメージ。";"CIAreaAverage" = "イメージ内の指定領域の平均色を計算して、1 ピクセルで結果を返します。";"CIAreaAverage.inputExtent" = "処理対象イメージのサブリージョンを指定する長方形。";"CIAreaAverage.inputImage" = "処理対象イメージ。";"CIRowAverage" = "イメージ内の指定領域内の各行の平均色を計算して、1D イメージで結果を返します。";"CIRowAverage.inputExtent" = "処理対象イメージのサブリージョンを指定する長方形。";"CIRowAverage.inputImage" = "処理対象イメージ。";"CIColumnAverage" = "イメージ内の指定領域内の各列の平均色を計算して、1D イメージで結果を返します。";"CIColumnAverage.inputExtent" = "処理対象イメージのサブリージョンを指定する長方形。";"CIColumnAverage.inputImage" = "処理対象イメージ。";"CIMinimumComponent" = "3 つの色成分の最小値を使って、イメージをグレイスケールに変換します。";"CIMinimumComponent.inputExtent" = "処理対象イメージのサブリージョンを指定する長方形。";"CIMinimumComponent.inputImage" = "処理対象イメージ。";"CIMaximumComponent" = "3 つの色成分の最大値を使って、イメージをグレイスケールに変換します。";"CIMaximumComponent.inputExtent" = "処理対象イメージのサブリージョンを指定する長方形。";"CIMaximumComponent.inputImage" = "処理対象イメージ。";